Autodesk.Revit.DB.TagMode
The modes of tag creation that are supported for IndependentTags.

Autodesk.Revit.DB.TagMode.TM_ADDBY_MATERIAL
Add a material tag.

Autodesk.Revit.DB.TagMode.TM_ADDBY_MULTICATEGORY
Add a multi-category tag.

Autodesk.Revit.DB.TagMode.TM_ADDBY_CATEGORY
Add a single category tag.